#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-E4nKQzWUX9QSabqS

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_security_group.allow_icmp: Refreshing state... [id=sg-08e7ed5aa3caa810e]
aws_security_group.allow_egress: Refreshing state... [id=sg-01bbbcc6e5692161b]
aws_security_group.allow_ssh: Refreshing state... [id=sg-006ce6110566350f2]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0501eb80aca197828]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-04768b6b76626b181]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-0551c3b1693af6c1c]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-03bb90570358ef413]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_instance.composer_internal: Refreshing state... [id=i-0d6d52766e8d4f91d]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-372124328]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-c9d09a9c-c9aa-4089-bbdc-91b6a9746395]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.external_cloudwatch_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "external_cloudwatch_logging"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "ec2:DescribeTags",
              + "ec2:DescribeVolumes",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "BasicCloudWatchUsage"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "CloudWatchSendLogs"
        }
    }

  # data.aws_iam_policy_document.internal_cloudwatch_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "internal_cloudwatch_logging"  {
      ~ id      = "2147288097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog",
                          - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging",
                        ]
                      - Sid      = "CloudWatchSendLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_group.external_composer will be created
  + resource "aws_cloudwatch_log_group" "external_composer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "external_composer_staging"
      + retention_in_days = 0
      + tags              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "📜 External composer log group for staging"
          + "ServiceOwner" = "Image Builder"
        }
    }

  # aws_cloudwatch_log_group.internal_composer will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "internal_composer" {
        id                = "internal_composer_staging"
        name              = "internal_composer_staging"
      ~ tags              = {
          ~ "Name"         = "Internal composer log group for staging" -> "📜 Internal composer log group for staging"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_stream.external_composer_syslog will be created
  + resource "aws_cloudwatch_log_stream" "external_composer_syslog" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "external_composer_staging"
      + name           = "external_composer_syslog"
    }

  # aws_ebs_volume.composer_external will be created
  + resource "aws_ebs_volume" "composer_external" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1f"
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 50
      + snapshot_id       = (known after apply)
      + tags              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🏗 External Composer (staging)"
          + "ServiceOwner" = "Image Builder"
        }
      + type              = "gp2"
    }

  # aws_iam_instance_profile.external_composer will be created
  + resource "aws_iam_instance_profile" "external_composer" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "external_composer_staging"
      + path        = "/"
      + role        = "external_composer_staging"
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.external_worker will be created
  + resource "aws_iam_instance_profile" "external_worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "external_worker_staging"
      + path        = "/"
      + role        = "external_worker_staging"
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.external_cloudwatch_logging will be created
  + resource "aws_iam_policy" "external_cloudwatch_logging" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "external_cloudwatch_logging_staging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_policy.external_composer_read_keys will be created
  + resource "aws_iam_policy" "external_composer_read_keys" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "external_composer_read_keys_staging"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:external_composer_keys-g5E0gT"
                      + Sid      = "ComposerReadSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.external_worker_read_keys will be created
  + resource "aws_iam_policy" "external_worker_read_keys" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "external_worker_read_keys_staging"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo"
                      + Sid      = "WorkerReadSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.internal_cloudwatch_logging will be updated in-place
  ~ resource "aws_iam_policy" "internal_cloudwatch_logging" {
        id     = "arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging"
        name   = "internal_cloudwatch_logging_staging"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog",
                          - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging",
                        ]
                      - Sid      = "CloudWatchSendLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.external_composer will be created
  + resource "aws_iam_role" "external_composer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "AllowEC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external_composer_staging"
      + path                  = "/"
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder external composer role - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.external_worker will be created
  + resource "aws_iam_role" "external_worker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "AllowEC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external_worker_staging"
      + path                  = "/"
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder external worker role - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.external_cloudwatch_composer will be created
  + resource "aws_iam_role_policy_attachment" "external_cloudwatch_composer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external_worker_staging"
    }

  # aws_iam_role_policy_attachment.external_cloudwatch_worker will be created
  + resource "aws_iam_role_policy_attachment" "external_cloudwatch_worker" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external_composer_staging"
    }

  # aws_iam_role_policy_attachment.external_composer_read_keys will be created
  + resource "aws_iam_role_policy_attachment" "external_composer_read_keys" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external_composer_staging"
    }

  # aws_iam_role_policy_attachment.external_worker_read_keys will be created
  + resource "aws_iam_role_policy_attachment" "external_worker_read_keys" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external_worker_staging"
    }

  # aws_instance.composer_external will be created
  + resource "aws_instance" "composer_external" {
      + ami                          = "ami-0e509a017007c92e2"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + iam_instance_profile         = "external_composer_staging"
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.small"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "obudai"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🏗 External Composer (staging)"
          + "ServiceOwner" = "Image Builder"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "83f7de5f27c173b4165a903d2efead3c5358167a"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_launch_template.worker_external_x86 will be created
  + resource "aws_launch_template" "worker_external_x86" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0e509a017007c92e2"
      + instance_type          = "t3.medium"
      + key_name               = "mhayden"
      + latest_version         = (known after apply)
      + name                   = "imagebuilder_worker_external_x86_staging"
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🔧 External Composer Worker (staging)"
          + "ServiceOwner" = "Image Builder"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp2"
            }
        }

      + iam_instance_profile {
          + name = "external_worker_staging"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "AppCode"      = "IMGB-001"
              + "Name"         = "🔧 External Composer Worker (staging)"
              + "ServiceOwner" = "Image Builder"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "AppCode"      = "IMGB-001"
              + "Name"         = "🔧 External Composer Worker (staging)"
              + "ServiceOwner" = "Image Builder"
            }
        }
    }

  # aws_network_interface.composer_external will be created
  + resource "aws_network_interface" "composer_external" {
      + id                 = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = [
          + "172.31.64.11",
        ]
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = "subnet-0c016a02"
      + tags               = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🏗 External Composer (staging)"
          + "ServiceOwner" = "Image Builder"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # aws_security_group.allow_egress will be destroyed
  - resource "aws_security_group" "allow_egress" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-01bbbcc6e5692161b" -> null
      - description            = "Allow egress traffic" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01bbbcc6e5692161b" -> null
      - ingress                = [] -> null
      - name                   = "external_allow_egress_staging" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "external_allow_egress_staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-78468405" -> null
    }

  # aws_security_group.allow_icmp will be destroyed
  - resource "aws_security_group" "allow_icmp" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-08e7ed5aa3caa810e" -> null
      - description            = "Allow ICMP access" -> null
      - egress                 = [] -> null
      - id                     = "sg-08e7ed5aa3caa810e" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ICMP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "external_allow_icmp_staging" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "external_allow_icmp_staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-78468405" -> null
    }

  # aws_security_group.allow_ssh will be destroyed
  - resource "aws_security_group" "allow_ssh" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-006ce6110566350f2" -> null
      - description            = "Allow SSH access" -> null
      - egress                 = [] -> null
      - id                     = "sg-006ce6110566350f2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = "ssh"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "external_allow_ssh_staging" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "external_allow_ssh_staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-78468405" -> null
    }

  # aws_security_group.external_allow_egress will be created
  + resource "aws_security_group" "external_allow_egress" {
      + arn                    = (known after apply)
      + description            = "Allow egress traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "external_allow_egress_staging"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "external_allow_egress_staging"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-78468405"
    }

  # aws_security_group.external_allow_icmp will be created
  + resource "aws_security_group" "external_allow_icmp" {
      + arn                    = (known after apply)
      + description            = "Allow ICMP access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ICMP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "external_allow_icmp_staging"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "external_allow_icmp_staging"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-78468405"
    }

  # aws_security_group.external_allow_ssh will be created
  + resource "aws_security_group" "external_allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "ssh"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "external_allow_ssh_staging"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "external_allow_ssh_staging"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-78468405"
    }

  # aws_spot_fleet_request.workers_external_x86 will be created
  + resource "aws_spot_fleet_request" "workers_external_x86" {
      + allocation_strategy                 = "lowestPrice"
      + client_token                        = (known after apply)
      + excess_capacity_termination_policy  = "Default"
      + fleet_type                          = "maintain"
      + iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder_spot_fleet_role_staging"
      + id                                  = (known after apply)
      + instance_interruption_behaviour     = "terminate"
      + instance_pools_to_use_count         = 1
      + load_balancers                      = (known after apply)
      + replace_unhealthy_instances         = false
      + spot_request_state                  = (known after apply)
      + tags                                = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "External worker fleet - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + target_capacity                     = 1
      + target_group_arns                   = (known after apply)
      + terminate_instances_with_expiration = true
      + wait_for_fulfillment                = false

      + launch_template_config {
          + launch_template_specification {
              + id      = (known after apply)
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external will be created
  + resource "aws_volume_attachment" "composer_external" {
      + device_name = "/dev/sdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 22 to add, 2 to change, 3 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*